      *================================================================*
      *Este programa calcula o fatorial de um numero                   *
      *================================================================*
      
       IDENTIFICATION DIVISION. 
       PROGRAM-ID. EXEC008.
       AUTHOR. ELIEL MIRANDA.

       ENVIRONMENT DIVISION. 

       DATA DIVISION. 

       PROCEDURE DIVISION.

       


     

