      *================================================================*
      *Este programa recebe um numero inteiro e infoma se ele eh par ou*
      *impar                                                           *
      *================================================================*
 
       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXEC004.
       AUTHOR. ELIEL MIRANDA.

       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION. 
          01 NUMERO.
             05 WS-NUMERO PIC 9(05) VALUE ZEROES.

           

       PROCEDURE DIVISION.



      