       IDENTIFICATION DIVISION.
       PROGRAM-ID. WELCOME.
       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
         77 WS-USERNAME PIC X(15) VALUE SPACES.

       PROCEDURE DIVISION.
           PERFORM 0000-USER-NAME.
           PERFORM 0001-MSG.
           STOP RUN.

       0000-USER-NAME.
           DISPLAY 'QUAL O SEU NOME? '
           ACCEPT WS-USERNAME.
       0001-MSG.
           DISPLAY 'BEM VINDO, ' WS-USERNAME '!'.
           