       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       ENVIRONMENT DIVISION.
       DATA DIVISION. 
       WORKING-STORAGE SECTION.           
       PROCEDURE DIVISION.
           DISPLAY 'BANCO EMUNAH - SITEMA BANCARIO'.
           STOP RUN.
       
       
