       IDENTIFICATION DIVISION. 
       PROGRAM-ID. PRATICA.
       ENVIRONMENT DIVISION. 

       DATA DIVISION. 
         WORKING-STORAGE SECTION. 
          77 MSG PIC X(40).

       PROCEDURE DIVISION.

       0000-INICIO.
           PERFORM 1000-MENSAGEM.
           STOP RUN.

       1000-MENSAGEM.
           MOVE 'BANCO EMUNAH - SISTEMA ONLINE!' TO MSG
           DISPLAY MSG.


