I      IDENTIFICATION DIVISION. 
       PROGRAM-ID. WSLSLS.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      *A WORKING-STORAGE SECTION SERVE PARA DECLARAR VARIAVEIS FIXAS
      * QUE PERMANECEM. FUNCIONA COMO UMA VARIAVEL GLOBAL.
      * CARACTERISTICAS: 1) CRIADA UMA VEZ; 2) PERMANECE NA MEMORIA 
      * 3) MANTEM VALOR ENTRE CHAMADAS
       LOCAL-STORAGE SECTION. 
      *A LOCAL-STORAGE SECTION SEVE PARA DECLARAR VARIAVEIS QUE ALOCAM
      * MEMORIA CADA VEZ QUE O PROGRAMA RECEBE UM CALL E EH APAGADA
      * EM SEGUIDA, OU SEJA, NAO EH PERSISTENTE.
      * EH MUITO USADO EM PROGRAMAS ON-LINE, COM MULTIPLOS USUARIOS.
      * CONSOME MAIS CPU POR SEMPRE ALOCAR/DESALOCAR A CADA CHAMADA.
       LINKAGE SECTION.
      *A LINKAGE SECTION SERVE PARA RECEBER DADOS DE OUTRO PROGRAMA.
      * NÃO ALOCA MEMORIA PROPRIA, ELA VEM DO DO CHAMADOR. É USADA COM
      * O COMANDO 'CALL'
       PROCEDURE DIVISION.
           STOP RUN.