       PROCEDURE DIVISION.
       0000-PRINCIPAL.
           PERFORM 1000-INICIO
           PERFORM 2000-PROCESSAR
           PERFORM 9000-FINALIZAR
           GOBACK.

       1000-INICIO.
           DISPLAY 'INICIANDO'.

       2000-PROCESSAR.
           PERFORM 2100-LER-ENTRADA
           PERFORM 2200-VALIDAR
           PERFORM 2300-GRAVAR.

       2100-LER-ENTRADA. CONTINUE.
       2200-VALIDAR.     CONTINUE.
       2300-GRAVAR.      CONTINUE.

       9000-FINALIZAR.
           DISPLAY 'FIM'.