       IDENTIFICATION DIVISION. 
       PROGRAM-ID. EX0102.
       PROCEDURE DIVISION.
           DISPLAY 'BANCO EMUNAH - SISTEMA ONLINE'.
           GOBACK.